app/controllers/sleep_records_controller.rb

SELECT "sleep_records".* FROM "sleep_records" WHERE "sleep_records"."user_id" = ? ORDER BY "sleep_records"."created_at" DESC  [["user_id", 1]]
---
  def index
    @sleep_records = SleepRecord.where(user_id: params[:user_id]).select(params[:select]).order(created_at: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sleep_records" ("user_id", "sleep_time", "wake_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["sleep_time", "2023-02-22 23:00:00"], ["wake_time", nil], ["created_at", "2023-02-26 23:41:20.723694"], ["updated_at", "2023-02-26 23:41:20.723694"]]
---
  def create
    @user = User.find(params[:user_id])
    @sleep_record = SleepRecord.new(sleep_time: params[:sleep_time], user_id: @user.id)
    # Save the sleep record
    if @sleep_record.save