app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bob"], ["created_at", "2023-02-26 23:31:57.685313"], ["updated_at", "2023-02-26 23:31:57.685313"]]
---
  def create
    @user = User.new(name: params[:name])
    if @user.save