app/controllers/user_follows_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."followee_id" = ?  [["followee_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @user_follows = UserFollow.where(followee_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "user_follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followee_id", 1], ["created_at", "2023-02-26 23:20:17.591256"], ["updated_at", "2023-02-26 23:20:17.591256"]]
---
  def create
    # Get the user
    @user = User.find(params[:user_id])
    # Get the user to follow
    @user_to_follow = User.find(params[:follower_id])
    # Create the user follow
    @user_follow = UserFollow.new(followee_id: @user.id, follower_id: @user_to_follow.id)
    # Save the user follow
    if @user_follow.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."followee_id" = ?  [["followee_id", 1]]
SELECT *, sleep_time - wake_time AS duration FROM "sleep_records" WHERE "sleep_records"."user_id" IN (?, ?) AND (created_at >= '2023-02-20 00:00:00') ORDER BY duration DESC  [["user_id", 2], ["user_id", 3]]
---
  def followers_sleep_records
    # Get the user
    @user = User.find(params[:user_id])
    # Get the user's followers
    @user_follows = UserFollow.where(followee_id: @user.id)
    # Get the sleep records for the last week, ordered by length of sleep
    week_ago = 1.week.ago.beginning_of_day
    @sleep_records = SleepRecord.where(user_id: @user_follows.map(&:follower_id)).where("created_at >= ?", week_ago)
    .select("*, sleep_time - wake_time AS duration")
    .order("duration DESC")